<?php

namespace App\Http\Controllers\Api\V1\General;

use App\Http\Controllers\Controller;
use App\Http\Requests\Api\V1\Profile\UpdateProfileRequest;
use App\Http\Resources\Profile\UserResource;
use Illuminate\Support\Facades\Response;

class InformationController extends Controller
{
    public function aboutMe()
    {
        return Response::success(
            message: __("About me"),
            data: [
                'description' => "به عنوان یک توسعه‌دهنده نرم‌افزار پرشور، تخصص من در ایجاد راه‌حل‌های نوآورانه‌ای است که پل ارتباطی بین فناوری و زبان هستند. اخیراً، من در یک پروژه هیجان‌انگیز برای توسعه یک برنامه کاربردی که صدا را به متن فارسی تبدیل می‌کند، شرکت کرده‌ام. این پروژه شامل استفاده از فناوری‌های پیشرفته تشخیص گفتار و پردازش زبان طبیعی برای اطمینان از دقت بالا و عملکرد بی‌نقص بود.

درک عمیق من از زبان فارسی و ابزارهای مدرن توسعه، این امکان را به من داد تا برنامه‌ای ایجاد کنم که نه تنها کلمات گفتاری را به متن تبدیل کند، بلکه به تفاوت‌ها و پیچیدگی‌های زبان فارسی نیز احترام بگذارد. این برنامه به گونه‌ای طراحی شده است که کاربرپسند باشد و به طیف وسیعی از کاربران، از دانشجویان و حرفه‌ای‌ها گرفته تا کاربران عادی که به یک ابزار مطمئن برای تبدیل گفتار به متن نیاز دارند، دسترسی داشته باشد.

در طول این پروژه، توانایی من در ادغام فناوری‌های مختلف، مدیریت فرآیندهای پیچیده و ارائه محصولی که نیازهای واقعی را برآورده کند، به نمایش گذاشته شد. تعهد من به یادگیری مداوم و نوآوری، من را به سمت کشف چالش‌های جدید و مشارکت معنادار در جامعه فناوری هدایت می‌کند.",
                'github' => 'https://github.com/aliabedi1',
                'linkedin' => 'https://t.me/abediali',
                'telegram' => 'https://linkedin.com/in/aliabedi1',
            ]
        );
    }


}
